Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེའི་རྣམ་པ་དང་ཡོན་ཏན་དང་དབྱིབས་དང་། ཁ་དོག་དང་རྒྱན་གྱིས་མཐར་ཕྱིན་པ་ནི་བསྐལ་པ་བརྒྱ་སྟོང་གྲངས་མེད་པར་ཡང་ཁོང་དུ་ཆུད་པར་མི་ནུས་ཏེ།
en: It would be impossible to fully comprehend its display of form, qualities, shape, and colors even in hundreds of thousands of asaṃkhyeya kalpas.

source: པད་མོ་ཆེན་པོ་དེ་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུ་སྐྱིལ་མོ་ཀྲུང་དུ་བཞུགས་པས་ཁྱབ་ཅིང་ཡོངས་སུ་རྒྱས་པར་མཐོང་ངོ་། །
en: “I saw the clear image of the body of a tathāgata sitting cross-legged on that great lotus and filling it.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་དེ་ཡང་འདི་ནས་བཟུང་བ་ནས། སྲིད་པའི་རྩེ་མོའི་བར་གྱི་མཐས་ཀླས་པར་མཐོང་ངོ་། །
en: I saw that tathāgata’s body extending from here up to the summit of existence.

source: དེ་བཞིན་གཤེགས་པ་དེའི་གདན་གྱི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པ་ཡང་མཐོང་ངོ་། །འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་།
en: I saw the inconceivable display of that tathāgata’s seat.

source: འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། མཚན་ཕུན་སུམ་ཚོགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། དཔེ་བྱད་བཟང་པོ་སྣ་ཚོགས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སངས་རྒྱས་ཀྱི་ཁྱུ་མཆོག་གི་མཐུ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་།
en: I saw the inconceivable circle of his followers, the inconceivable extent of his halo, his inconceivable perfect primary signs of a great being, his inconceivable various secondary features of a great being, his inconceivable majesty and power, his inconceivable miracles of buddhahood, the inconceivable color of the tathāgata’s body, the inconceivable invisible crown of his head, and his inconceivable vast tongue.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་མདོག་རྣམ་པར་དག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སྤྱི་གཙུག་ལྟར་མི་མཐོང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ལྗགས་ཡངས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡང་མཐོང་ངོ་། །སངས་རྒྱས་ཀྱི་གསུང་གི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། དབྱངས་ཀྱི་དཀྱིལ་འཁོར་བསམ་གྱིས་མི་ཁྱབ་པའང་ཐོས་སོ། །
en: “I heard the inconceivable display of that buddha’s speech and the inconceivable range of his voice.

source: སྟོབས་ཚད་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་མི་བསྙེངས་པའི་རྒྱན་རྣམ་པར་དག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པའི་སྟོབས་མངོན་པར་བསྒྲུབ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡང་རྗེས་སུ་ཤེས་སོ། །
en: I comprehended his inconceivable limitless strength, his inconceivable display of fearlessness, and his inconceivable accomplishment of the power of discernment.

source: སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡང་དག་པར་བསྒྲུབ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡང་རྗེས་སུ་དྲན་ནོ། །
en: I remembered his inconceivable past accomplishment of bodhisattva conduct.

source: མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པའི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡང་མཐོང་ངོ་། །
en: I saw the inconceivable miracle of his complete enlightenment.

source: ཆོས་ཀྱི་སྤྲིན་གྱི་འབྲུག་སྒྲ་མངོན་པར་བསྒྲགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཡོངས་སུ་བསྟན་པ་རྣམ་པར་དམིགས་པའི་གནས་དང་། རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པའང་ཐོས་སོ། །
en: I heard the inconceivable resounding of the thunder of Dharma and the inconceivable array of the perceived communication of the complete teaching.

source: གཡས་གཡོས་ཀྱི་སྐུའི་རྣམ་པ་ཚད་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སེམས་ཅན་གྱི་དོན་དང་དགོས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་གྲུབ་པར་འགྱུར་བའང་མཐོང་ངོ་། །དེ་བཞིན་གཤེགས་པ་དེས་ཀྱང་ཕྱག་གཡས་པ་བརྐྱང་ཞིང་ཁོ་བོའི་མགོ་ལ་བྱུགས་ནས། ཆོས་ཀྱི་རྣམ་གྲངས་ཀུན་ནས་མྱིག་ཅེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རབ་ཏུ་བརྗོད་པ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་གཞི་དང་།
en: I saw the inconceivable, immeasurable right and left parts of his body and the inconceivable accomplishment of a body that benefits beings.

source: རྣམ་པ་ཐ་དད་པ་ཐམས་ཅད་རབ་ཏུ་སྣང་བ་ཆོས་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་ལ་ཡང་དག་པར་གཞོལ་ཞིང་སྣང་པར་བྱེད་པ། ཞིང་གི་དཀྱིལ་འཁོར་དང་རྣམ་པ་ཐམས་ཅད་རྣམ་པར་དག་པས་ཡོངས་སུ་སྣང་བ། ཕས་ཀྱི་རྒོལ་བའི་དཀྱིལ་འཁོར་ཐམས་ཅད་རྣམ་པར་འཐོར་བ་བདུད་ཀྱི་དཀྲུགས་མའི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་འཇོམས་པ། སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཤིན་ཏུ་ཚིམ་པར་བྱེད་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་ཐིབས་པོ་རབ་ཏུ་སྣང་བར་བྱེད་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་དམིགས་པ།
en: “That tathāgata extended his right hand and stroked my head and taught me a Dharma teaching called All-Seeing Eyes, which is the field of all the tathāgatas, reveals the conduct of bodhisattvas, illuminates the different bases of the realm of phenomena, illuminates the compiled field of all Dharmas, is the pure vision of the forms of the range of all realms, scatters the entire range of adversaries, defeats the entire range of the discord of the māras, brings satisfaction to all realms of beings, illuminates the darkness in the minds of all beings, communicates in accord with the thoughts of all beings, and illuminates the turning wheel of the faculties of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོའི་འཁོར་ལོའི་རྒྱུད་དང་། མཐུ་སྣང་བར་བྱེད་པ་ཡང་དག་པར་བསྟན་ཏེ། ཁོ་བོས་ཡང་ཀུན་ནས་མིག་གི་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་བླངས་སོ། །བཟུང་ངོ་སྤེལ་ཏོ་བསམས་སོ། །
en: “I acquired, possess, follow, and contemplate this Dharma teaching called All-Seeing Eyes.

source: དེ་ལྟར་བཟུང་བ་དེ་ལའང་བྲི་ན་ནི་སྣག་ཚ་རྒྱ་མཚོ་ཆེན་པོའི་ཕུང་པོ་ཙམ་དང་། སྨྱི་གུའི་ཕུང་པོ་རི་རབ་རིའི་རྒྱལ་པོ་ཙམ་ཟད་པར་གྱུར་ཀྱང་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་ལས་ལེའུ་རེ་རེ་དང་སྒོ་རེ་རེ་དང་ཆོས་ཀྱི་ཚུལ་རེ་རེ་དང་ཆོས་ཀྱི་ཚིག་རྣམ་པར་ཕྱེ་བ་རེ་རེ་ལས་ཀྱང་ཟད་པ་འམ། འགྲིབ་པ་འམ། འབྱང་བ་འམ། མཐར་ཐུག་པའམ། མཐའ་ཟད་པར་འགྱུར་བ་དམིགས་པར་མི་རུང་ངོ་། །
en: “Having thus acquired it, if one were to use a volume of ink equal to the great ocean and a heap of pens the size of Sumeru, the king of mountains, to write it out, one would not be able reach the end of a single chapter, a single gateway, a single Dharma way, or a single category of words from that Dharma teaching, nor could one diminish what is to be written, complete it, finish it, or reach the end.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་བདག་གིས་ལོ་བཅུ་གཉིས་ཚང་བར་ཆོས་ཀྱི་རྣམ་གྲངས་ཀུན་ནས་མིག་ཅེས་བྱ་བ་འདི་ལ་ཉི་མ་གཅིག་ཅིང་ཡང་ཐོས་པ་འཛིན་པའི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་ཁོང་དུ་ཆུད་དོ། །
en: “Noble one, in that way I have possessed this Dharma teaching called All-Seeing Eyes for an entire twelve years. Having thus acquired it, in a single day I can understand countless chapters through the illumination of the light of the power of retention called remembering what is heard.

source: ཞི་བའི་སྒོའི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་ལ་ཞུགས་སོ། །
en: I can comprehend countless chapters through the illumination of the light of the power of retention called the gateway to peace.

source: གློང་མཐའ་ཡས་པའི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་ལ་ཡང་དག་པར་འཇུག་གོ །
en: I can fathom countless chapters through the illumination of the light of the power of retention called endless revolving.

source: ས་ལ་རྣམ་པར་དཔྱོད་ཅིང་རྗེས་སུ་རྟོག་པར་བྱེད་པའི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་རྣམ་པར་བསྒོམས་ཏེ་རྣམ་པར་དབྱེ་བ་བྱས་སོ། །
en: I can consider and investigate countless chapters through the illumination of the light of the power of retention called examining and analyzing the levels.

source: གཟི་བརྗིད་དང་ལྡན་པའི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་ཡོངས་སུ་བླངས་སོ། །
en: I can conclude countless chapters through the illumination of the light of the power of retention called majestic.

source: པད་མོའི་རྒྱན་གྱི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་མངོན་པར་བསྒྲུབས་སོ། །
en: I can accomplish countless chapters through the illumination of the light of the power of retention called array of lotuses.

source: དབྱངས་ཀྱི་ཚུལ་གྱི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་ཡང་དག་པར་བཤད་དོ། །
en: I can elucidate countless chapters through the illumination of the light of the power of retention called distinct voice.

source: ནམ་མཁའི་སྙིང་པོའི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་རབ་ཏུ་ཕྱེ་བའོ། །
en: I can distinguish countless chapters through the illumination of the light of the power of retention called the essence of space.

source: སྐར་མ་བརྩེགས་པའི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་ཤིན་ཏུ་རྒྱས་པར་བྱས་སོ། །
en: I can expand on countless chapters through the illumination of the light of the power of retention called the multitude of stars.

source: རྒྱ་མཚོ་སྙིང་པོའི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་ཡོངས་སུ་བཀོད་དོ། །
en: I can arrange countless chapters through the illumination of the light of the power of retention called the essence of the ocean.

source: ཁོ་བོའི་དྲུང་དུ་ཤར་ཕྱོགས་ལོགས་ནས་ལྷ་དང་ལྷའི་དབང་པོའམ།
en: “Beings have arrived before me to the east.

source: ཀླུ་དང་ཀླུའི་དབང་པོ་འམ། གནོད་སྦྱིན་དང་གནོད་སྦྱིན་གྱི་དབང་པོ་འམ། དྲི་ཟ་དང་དྲི་ཟའི་དབང་པོ་འམ། ལྷ་མ་ཡིན་དང་ལྷ་མ་ཡིན་གྱི་དབང་པོའམ། ནམ་མཁའ་ལྡིང་དང་ནམ་མཁའ་ལྡིང་གི་དབང་པོའམ། མིའམ་ཅི་དང་མི་འམ་ཅིའི་དབང་པོའམ། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་འམ། མི་དང་མིའི་དབང་པོའམ།
en: There are devas and deva lords, nāgas and nāga lords, yakṣas and yakṣa lords, gandharvas and gandharva lords, asuras and asura lords, garuḍas and garuḍa lords, kinnaras and kinnara lords, mahoragas and mahoraga lords, humans and human lords, brahmins and brahmin lords.

source: ཚངས་པ་དང་། ཚངས་པའི་དབང་པོའམ། སེམས་ཅན་གང་སུ་འོངས་ཀྱང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྣང་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀུན་ནས་མིག་ཅེས་བྱ་བ་འདི་ཉིད་དུ་ལ་རབ་ཏུ་བཀོད་ཅིང་བཙུད་དེ།
en: I establish them in and bring them all into this Dharma teaching called All-Seeing Eyes that illuminates the conduct of the tathāgatas and bodhisattvas.

source: དེ་དག་ཀུན་ཀྱང་ཀུན་ནས་མིག་གི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་ལ་མོས་པར་བྱས་སོ། །རྟོག་ཏུ་བཙུད་དོ། །ཡོངས་སུ་བསྟན་ཏོ། །ཡང་དག་པར་བརྗོད་དོ། །ཡོངས་སུ་གསལ་བར་བྱས་སོ། །རྣམ་པར་ཕྱེའོ། །རྒྱས་པར་བྱས་སོ། །མངོན་པར་བསྟན་ཏོ། །རྣམ་པར་བཀྲོལ་ལོ་རབ་ཏུ་ཕྱེའོ། །ཤིན་ཏུ་སྣང་བར་བྱས་སོ། །
en: For all of them I clarify, delineate, elucidate, describe, teach, categorize, expand, reveal, expound, and illuminate this Dharma teaching called All-Seeing Eyes.

source: དེ་ལྟར་ཤར་ཕྱོགས་ལ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་།
en: “As in the east, it is the same for the beings who arrive to the south, the west, the north, the northeast, the southeast, the southwest, the northwest, above, and below.

source: འོག་དང་བླའི་ཕྱོགས་ནས་སེམས་ཅན་གང་སུ་འོངས་ཀྱང་རུང་སྟེ། ཀུན་ལ་ཡང་སྔ་མ་བཞིན་ནོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོས་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་གཅིག་ཅིག་ཤེས་པར་ཟད་ན། བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ཡོངས་སུ་དག་པ་དང་ལྡན་པས།
en: “Noble one, in this way I know but one Dharma teaching.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ། བསྐལ་པ་ཐམས་ཅད་དུ་གནས་པ་རྒྱུ་མི་འཆད་པའི་ཕྱིར་སྨོན་ལམ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ་དང་། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྗེས་སུ་འབྲང་བར་བྱ་བའི་ཕྱིར་སེམས་ཅན་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ་དང་། སྟོབས་བཅུའི་ཡེ་ཤེས་ཆགས་པ་མེད་པའི་སྣང་བ་ཡོངས་སུ་བསྐྱེད་པའི་ཕྱིར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་རྒྱ་མཚོ་ལ་ཞུགས་པ་དང་། ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་།
en: How could I know the conduct or describe the qualities of bodhisattvas?

source: གདུལ་བའི་དུས་ལ་མི་འདའ་བར་བྱ་བའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དང་། ཞིང་ཐམས་ཅད་རྣམ་པར་དག་པར་བྱ་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པས། ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་ཅིང་རིམ་གྲོ་བྱེད་པའི་སྟོབས་ཀྱིས་སངས་རྒྱས་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ་དང་། ཡེ་ཤེས་རྣམ་པར་རིག་པས་ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ་དང་།
en: They have entered the ocean of bodhisattva conduct in order to gain pure aspiration; they have entered the ocean of all aspirations in order to remain continuously throughout all kalpas; they have entered the ocean of all beings in order to follow a conduct that accords with their wishes; they have entered the ocean of the minds of all beings in order to communicate wisdom; they have entered the ocean of all good qualities in order to develop the unimpeded radiance of the wisdom of the ten strengths; they have entered the ocean of the faculties of all beings in order not to miss the time for ripening and guiding them; they have entered the ocean of realms in order to fulfill the aspiration to purify all realms; they have entered the ocean of buddhas in order to serve and make offerings to the tathāgatas; they have entered the ocean of Dharma in order to communicate wisdom; they have entered the ocean of good qualities in order to reach attainment; and they have entered the ocean of the languages of beings in order to turn the wheel of the Dharma in all languages.

source: ནན་ཏན་དང་ལྡན་པས་ཡོན་ཏན་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ་དང་། བརྗོད་པ་ཐམས་ཅད་དུ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་མངོན་པར་བསྒྲུབ་པའི་ཕྱིར། འགྲོ་བའི་སྐད་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ་རྣམས་ཀྱི་སྤྱོད་པ་ཤེས་པའམ།
en: “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་འདི་ནས་དཔག་ཚད་དྲུག་ཅུ་འདས་པའི་ལྷོ་ཕྱོགས་ཀྱི་གནས་འདི་ཉིད་ན།
en: Sixty yojanas from here on the road south, there is a place named Sāgara­tīra on the road to Laṅka.

source: ལང་ཀའི་གནས་རྒྱ་མཚོའི་དོགས་ཤེས་བྱ་བ་ཡོད་དེ། དེ་ན་དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་ཞེས་བྱ་བ་འདུག་གིས།
en: There dwells a bhikṣu by the name of Supratiṣṭhita.

source: དེའི་གན་དུ་སོང་ལ། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་སྦྱང་བར་བྱ་བ་དྲིས་ཤིག །
en: Go to him and ask him, ‘How does a bodhisattva train in bodhisattva conduct?’ ”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་སློང་རྒྱ་མཚོའི་སྤྲིན་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། དགེ་སློང་རྒྱ་མཚོའི་སྤྲིན་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། དགེ་སློང་རྒྱ་མཚོའི་སྤྲིན་གྱི་དྲུང་ནས་སོང་ངོ་། །
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the bhikṣu Sāgara­megha, circumambulated the bhikṣu Sāgara­megha many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the bhikṣu Sāgara­megha.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་དེ་དང་། ཀུན་ནས་མིག་གི་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་ཡང་རྗེས་སུ་དྲན་པར་བྱེད་ཅིང་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་དེ་ཡང་རྗེས་སུ་བསམ་པ་དང་། ཆོས་ཀྱི་ཚིག་དང་ཡི་གེའི་སྤྲིན་དེ་དག་ཀྱང་ཡོངས་སུ་གཟུང་བ་དང་། ཆོས་ཀྱི་སྒོ་རྒྱ་མཚོའི་ཚུལ་དེ་དག་ལའང་འཇུག་པར་བྱ་བ་དང་ཆོས་ཀྱི་ཚུལ་དེའང་རྣམ་པར་བལྟ་བ་དང་། ཆོས་ཀྱི་ལེའུ་དང་གློང་གི་ཚུལ་དེ་དག་ལ་འཇུག་པར་བྱ་བ་དང་། ཆོས་ཀྱི་ནམ་མཁའ་དེ་ལ་ཡང་དག་པར་གཞོལ་བར་བྱ་བ་དང་། ཆོས་ཀྱི་དཀྱིལ་འཁོར་དེ་ཡང་རྗེས་སུ་སྦྱང་བར་བྱ་བ་དང་།
en: Supratiṣṭhita Chapter 6 Then Sudhana, the head merchant’s son, remembering the instructions of the kalyāṇamitra and the Dharma teaching called All-Seeing Eyes, contemplating the miracles of that tathāgata, keeping in his mind the clouds of the words and terms of that Dharma, comprehending that ocean of Dharma gateways, observing the precepts of that Dharma, entering those ways of turning toward the Dharma, absorbed into the sky of that Dharma, purifying the range of that Dharma, and meditating on the precious continent of that Dharma, eventually arrived at Sāgara­tīra in the Laṅka region.

source: ཆོས་རིན་པོ་ཆེའི་གླིང་དེ་ཡང་རྗེས་སུ་སེམས་ཤིང་མཐར་གྱིས་ལང་ཀའི་གནས་རྒྱ་མཚོའི་ངོགས་ཤེས་བྱ་བ་གདན་པ་དེར་ཕྱིན་ནས། དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་མཐོང་བར་དགའ་ཞིང་ཤར་ཕྱོགས་སུ་བལྟས་སོ། །དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་།
en: Wishing to see the bhikṣu Supratiṣṭhita, he looked for him in the eastern direction.

source: བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། བླ་དང་འོག་ཏུ་དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་མཐོང་བར་དགའ་སྟེ།
en: In the same way, wishing to see the bhikṣu Supratiṣṭhita, he looked for him everywhere: in the southern direction, in the western direction, in the northern direction, in the northeastern direction, in the southeastern direction, in the southwestern direction, in the northwestern direction, above, and below.

source: ཀུན་ཏུ་བལྟས་པ་དང་། དེས་དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་ནམ་མཁའི་དབྱིངས་ལ་ལྷ་བརྒྱ་སྟོང་གྲངས་མེད་པས་ཡོངས་སུ་བསྐོར་ཅིང་ཕན་ཚུན་དུ་འཆག་པ་མཐོང་ངོ་། །
en: Then he saw the bhikṣu Supratiṣṭhita walking back and forth in the sky accompanied by countless hundreds of thousands of devas.

source: ནམ་མཁའི་དབྱིངས་དེ་ཡང་ལྷའི་དབང་པོ་རྣམས་ཀྱིས་དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་ལ་མཆོད་པའི་ལས་སུ་བྱ་བའི་ཕྱིར། ལྷ་རྫས་ཀྱི་མེ་ཏོག་སིལ་མའི་སྤྲིན་གྱིས་ཡོག་པ་དང་། ལྷ་རྫས་ཀྱི་རོལ་མོའི་སྤྲིན་གྱི་སྒྲ་དང་། དར་གྱི་བ་དན་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པར་མཐོང་ངོ་། །
en: He saw deva lords in the sky making offerings to the bhikṣu Supratiṣṭhita with clouds of scattered divine flower petals, the sound of countless clouds of divine music, and countless adorning streamers and banners.

source: ཀླུའི་དབང་པོ་རྣམས་ཀྱིས་ནམ་མཁའ་དེ་ལ་ཨ་ག་རུ་ནག་པོའི་སྤོས་མངོན་པར་འཐུལ་བའི་སྤྲིན་ཤིན་ཏུ་མཐོ་བ་ལས་འབྲུག་སྒྲ་བསམ་གྱིས་མི་ཁྱབ་པ་འབྱུང་བར་བྱས་པ་མཐོང་ངོ་། །
en: He saw that nāga lords in the sky had created high clouds, made of the spreading incense smoke of black agarwood, from which came inconceivable claps of thunder.

source: མི་འམ་ཅིའི་དབང་པོ་རྣམས་ཀྱིས་ནམ་མཁའ་དེ་ལ་ལྷ་རྫས་ཀྱི་ངག་སྙན་པའི་རྒྱུད་ཀྱི་བསྟོད་པའི་རོལ་མོ་བརྡུང་བ་དང་། དཀྲོལ་བ་དང་གླུར་བླང་བའི་དབྱངས་ཐམས་ཅད་སྦྱར་ཅིང་བླངས་པ་ཐོས་པར་གྱུར་ཏོ། །
en: He heard kinnara lords offering their divine beautiful voices in songs of praise and the sounds of a concert with all musical instruments being played.

source: ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་རྣམས་ཀྱིས་ནམ་མཁའ་དེ་ལ་གོས་ཤིན་ཏུ་ཕྲ་ཞིང་མདོག་བཟང་བའི་སྤྲིན་བསམ་གྱིས་མི་ཁྱབ་པ་དག་ཡིད་དགའ་བས་བཀྱེ་སྟེ། དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་ལ་དད་ཅིང་མོས་པའི་གཟུགས་སུ་ཕྱུང་བ་མཐོང་ངོ་། །
en: He saw mahoraga lords in the sky joyfully and with faith bringing forth an inconceivable cloud of fine clothing in beautiful colors, with the appearance of delighting in the bhikṣu Supratiṣṭhita.

source: ལྷ་མ་ཡིན་གྱི་དབང་པོ་རྣམས་ཀྱིས་ཀྱང་ནམ་མཁའ་དེ་ལ་ནོར་བུ་རིན་པོ་ཆེའི་སྤྲིན་བསམ་གྱིས་མི་ཁྱབ་པ་བྱིན་གྱིས་བརླབས་ཏེ། ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་སྣང་བ་དང་ལྡན་པར་བྱས་པ་མཐོང་ངོ་། །
en: He saw asura lords in the sky conjuring an inconceivable cloud of precious jewels shining with an inconceivable display of qualities.

source: ནམ་མཁའ་ལྡིང་གི་དབང་པོ་མང་པོ་ཡང་མྱིའི་གཟུགས་དང་ཁ་དོག་དང་དབྱིབས་སུ་འཁོད་ཅིང་ནམ་མཁའ་ལྡིང་གི་དབང་པོའི་བུ་མོས་ཀུན་ནས་བསྐོར་ཏེ། གསོད་པ་མེད་པ་ལ་དགའ་ཞིང་ཐལ་མོ་སྦྱར་ཏེ་གནས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་མཐོང་ངོ་། །
en: He saw a gathered multitude of garuḍa lords in human form, color, and shape, encircled by the daughters of the garuḍa lords, delighting in nonviolence and with their palms together in homage.

source: གནོད་སྦྱིན་གྱི་དབང་པོ་བརྒྱ་སྟོང་འཁོར་དང་བཅས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དག་ཀྱང་ནམ་མཁའ་དེ་ལ་ཤིན་ཏུ་མི་སྡུག་པའི་གཟུགས་སུ་དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་ལ་བྱམས་པའི་མཐུ་དང་ལྡན་པར་འཁོད་པ་མཐོང་ངོ་། །
en: He saw an inconceivable hundred thousand yakṣa lords, arranged with their retinues in the sky, who had very ugly bodies and the power of love toward the bhikṣu Supratiṣṭhita.

source: སྲིན་པོའི་དབང་པོ་བརྒྱ་སྟོང་འཁོར་དང་བཅས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དག་ཀྱང་ནམ་མཁའ་དེ་ལ་དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་ཡོངས་སུ་བསྲུང་བ་བྱེད་ཅིང་ཀུན་ཏུ་རྒྱུ་བ་མཐོང་ངོ་། །
en: He saw an inconceivable hundred thousand rākṣasa lords with their retinues in the sky who circled around the bhikṣu Supratiṣṭhita, guarding him.

source: ཚངས་པའི་དབང་པོ་བརྒྱ་སྟོང་བསམ་གྱིས་མི་ཁྱབ་པ་དག་ཀྱང་ནམ་མཁའ་དེ་ལ་ཐལ་མོ་སྦྱར་ཅིང་དགའ་བ་དང་ཡིད་དུ་འོང་བའི་ཚིག་གི་རྒྱུད་ཀྱི་བསྟོད་པ་རབ་ཏུ་བརྗོད་པ་མཐོང་ངོ་། །
en: He saw an inconceivable hundred thousand Brahmakāyika lords with their retinues in the sky with their palms together in homage, engaged in singing his praises with beautiful, melodious voices.

source: གནས་གཙང་མའི་ལྷ་བརྒྱ་སྟོང་བསམ་གྱིས་མི་ཁྱབ་པ་དག་ཀྱང་ནམ་མཁའ་དེ་ལ་དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་ལ་མཆོད་པའི་ལས་སུ་བྱ་བའི་ཕྱིར་ཐལ་མོ་སྦྱར་ཅིང་གཞལ་མེད་ཁང་ན་གནས་པ་མཐོང་ངོ་། །
en: He saw an inconceivable hundred thousand Śuddhāvāsa devas in their aerial palaces in the sky making offerings to the bhikṣu Supratiṣṭhita.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་དེ་ལྟར་ནམ་མཁའི་དབྱིངས་ལ་འཆག་ཅིང་འདུག་པ་མཐོང་ནས་དགའ་རངས་ཏེ་མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས། དགེ་སློང་ཤིན་ཏུ་བརྟན་པ་ལ་ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Sudhana, the head merchant’s son, on seeing the bhikṣu Supratiṣṭhita walking in the sky, was filled with joy, delighted, elated, pleased, and happy.

source: འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཆོས་བཙལ་བར་བགྱི་བ་དང་།
en: He placed his palms together in homage and said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know this—how should a bodhisattva seek for the Buddhadharma?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་བསྒྲུབ་པར་བགྱི་བ་དང་།
en: How should a bodhisattva obtain the Buddhadharma?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་བསྡུ་བར་བགྱི་བ་དང་།
en: How should a bodhisattva compile the Buddhadharma?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་བསྟན་པར་བགྱི་བ་དང་།
en: How should a bodhisattva serve the Buddhadharma?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་བསྒོམ་པར་བགྱི་བ་དང་།
en: How should a bodhisattva protect the Buddhadharma?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བར་བགྱི་བ་དང་།
en: How should a bodhisattva follow the Buddhadharma?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་བརྟུལ་བར་བགྱི་བ་དང་།
en: How should a bodhisattva accumulate the Buddhadharma?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་བསྒོམ་པར་བགྱི་བ་དང་།
en: How should a bodhisattva pervade the Buddhadharma?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམ་པར་དག་པར་བགྱི་བ་དང་།
en: How should a bodhisattva purify the Buddhadharma?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་སྦྱང་བར་བགྱི་བ་དང་།
en: How should a bodhisattva train in the Buddhadharma?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་ཁོང་དུ་ཆུད་པར་བགྱི་བ་མ་འཚལ་ཏེ།
en: How should a bodhisattva understand the Buddhadharma?

source: འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ། །ཞེས་བདག་གིས་ཐོས་ན། འཕགས་པ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཆོས་ལ་ནན་ཏན་དུ་བགྱི། ཇི་ལྟར་ནན་ཏན་བགྱིས་ན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དང་། སྐོལ་བར་མི་འགྱུར་བའི་སླད་དུ་སངས་རྒྱས་མཐོང་བ་དང་མི་འབྲལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་དང་། ཚུལ་གཅིག་ཏུ་འགྱུར་བའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དང་མི་འབྲལ་བ་དང་།
en: “Ārya, I have heard that you give instruction and teachings to bodhisattvas!

source: ཡེ་ཤེས་རྟོགས་པར་འགྱུར་བའི་སླད་དུ་སངས་རྒྱས་ཀྱི་ཆོས་དང་མི་འབྲལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དོན་ཡོངས་སུ་ཐོབ་པར་བགྱི་བའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ཐམས་ཅད་དང་མི་འབྲལ་བ་དང་། བསྐལ་པ་ཐམས་ཅད་དུ་གནས་པས་ཡོངས་སུ་མི་སྐྱོ་བར་བགྱི་བའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་མི་འབྲལ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བགྱི་བའི་སླད་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རྒྱས་པར་དགང་བ་དང་མི་འབྲལ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་རྣམ་པར་དམིགས་པར་བགྱི་བའི་སླད་དུ་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་མཐོང་བ་དང་མི་འབྲལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྲུལ་པ་ལྟ་བུས་སྲིད་པའི་རྒྱུད་ཐམས་ཅད་དུ་སྐྱེ་ཞིང་འཆི་འཕོ་བའི་སྐྱེ་མཆེད་རང་གི་ལུས་ཀྱིས་ཉམས་སུ་མྱོང་བར་བགྱི་བའི་སླད་དུ་འདུས་བྱས་ཀྱི་གནས་དང་མི་འབྲལ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་ཡོངས་སུ་གཟུང་བའི་སླད་དུ་ཆོས་མཉན་པ་དང་མི་འབྲལ་བ་དང་། དུས་གསུམ་གྱི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་ཅིང་རྗེས་སུ་འབྲང་བར་བགྱི་བའི་སླད་དུ།
en: Therefore, Ārya, teach me how bodhisattvas should practice the Buddhadharma so that while practicing they will not lack the sight of the Buddha in order to not become separated from the truth; will not lack the vision of the bodhisattvas in order to have the same way as the roots of merit of all bodhisattvas; will not lack the Buddhadharma in order to realize wisdom; will not lack the bodhisattva aspiration in order to attain all the goals of the bodhisattvas; will not lack bodhisattva conduct in order to never become weary of remaining throughout all kalpas; will not lack the pervading of all buddha realms in order to purify all world realms; will not lack seeing the miracles of buddhas in order to perceive all the miraculous manifestations of all the tathāgatas; will not lack a composite presence so that through bodhisattva conduct that is like a magical creation they will experience as their own bodies the āyatanas that are born and pass away within all existences; will not lack hearing the Dharma in order to obtain the clouds of Dharma of all the tathāgatas; and will not lack the light of wisdom in order to gain and use the knowledge of the three times.”
